// WavTable.h

#ifndef __WAVTABLE_H__
#define __WAVTABLE_H__

#include "sgl_inc.h"
#include "rg_def.h"
#include "../../rgdata/NcWavList.h"

// 시도 경계 안내 문구    2007.09.20, bridge
static const AREA_INTRODUCE	INTRODUCE_TABLE[] = 
{
	{	42150,	IDWA_001	},
	{	42170,	IDWA_002	},
	{	42230,	IDWA_003	},
	{	42210,	IDWA_004	},
	{	42130,	IDWA_005	},
	{	42110,	IDWA_006	},
	{	42190,	IDWA_007	},
	{	42   ,	IDWA_008	}, // 강원도
	{	41281,	IDWA_009	}, // 고양시
	{	41285,	IDWA_009	}, // 고양시
	{	41287,	IDWA_009	}, // 고양시
	{	41290,	IDWA_010	},
	{	41210,	IDWA_011	},
	{	41610,	IDWA_012	},
	{	41310,	IDWA_013	},
	{	41410,	IDWA_014	},
	{	41570,	IDWA_015	},
	{	41360,	IDWA_016	},
	{	41250,	IDWA_017	},
	{	41195,	IDWA_018	}, // 부천시
	{	41197,	IDWA_018	}, // 부천시
	{	41199,	IDWA_018	}, // 부천시
	{	41131,	IDWA_019	}, // 성남시
	{	41133,	IDWA_019	}, // 성남시
	{	41135,	IDWA_019	}, // 성남시
	{	41111,	IDWA_020	}, // 수원시
	{	41113,	IDWA_020	}, // 수원시
	{	41115,	IDWA_020	}, // 수원시
	{	41117,	IDWA_020	}, // 수원시
	{	41390,	IDWA_021	},
	{	41271,	IDWA_022	}, // 안산시
	{	41273,	IDWA_022	}, // 안산시
	{	41550,	IDWA_023	},
	{	41171,	IDWA_024	}, // 안양시
	{	41173,	IDWA_024	}, // 안양시
	{	41630,	IDWA_025	},
	{	41370,	IDWA_026	},
	{	41461,	IDWA_027	}, // 용인시
	{	41463,	IDWA_027	}, // 용인시
	{	41465,	IDWA_027	}, // 용인시
	{	41430,	IDWA_028	},
	{	41150,	IDWA_029	},
	{	41500,	IDWA_030	},
	{	41480,	IDWA_031	},
	{	41220,	IDWA_032	},
	{	41650,	IDWA_033	},
	{	41450,	IDWA_034	},
	{	41590,	IDWA_035	},
	{	41   ,	IDWA_036	},  // 경기도
	{	48310,	IDWA_037	},
	{	48250,	IDWA_038	},
	{	48160,	IDWA_039	},
	{	48270,	IDWA_040	},
	{	48240,	IDWA_041	},
	{	48330,	IDWA_042	},
	{	48170,	IDWA_043	},
	{	48190,	IDWA_044	},
	{	48110,	IDWA_045	},
	{	48220,	IDWA_046	},
	{	48   ,	IDWA_047	},  // 경상남도
	{	47290,	IDWA_048	},
	{	47130,	IDWA_049	},
	{	47190,	IDWA_050	},
	{	47150,	IDWA_051	},
	{	47280,	IDWA_052	},
	{	47250,	IDWA_053	},
	{	47170,	IDWA_054	},
	{	47210,	IDWA_055	},
	{	47230,	IDWA_056	},
	{	47111,	IDWA_057	}, // 포항시
	{	47113,	IDWA_057	}, // 포항시
	{	47   ,	IDWA_058	}, // 경상북도
	{	46230,	IDWA_059	},
	{	46170,	IDWA_060	},
	{	46110,	IDWA_061	},
	{	46150,	IDWA_062	},
	{	46130,	IDWA_063	},
	{	46   ,	IDWA_064	}, // 전라남도
	{	45130,	IDWA_065	},
	{	45210,	IDWA_066	},
	{	45190,	IDWA_067	},
	{	45140,	IDWA_068	},
	{	45111,	IDWA_069	}, // 전주시
	{	45113,	IDWA_069	}, // 전주시
	{	45180,	IDWA_070	},
	{	45   ,	IDWA_071	}, // 전라북도
	{	50130,	IDWA_072	},
	{	50110,	IDWA_073	},
	{	50   ,	IDWA_074	}, // 제주도
	{	44250,	IDWA_075	},
	{	44150,	IDWA_076	},
	{	44230,	IDWA_077	},
	{	44180,	IDWA_078	},
	{	44210,	IDWA_079	},
	{	44200,	IDWA_080	},
	{	44130,	IDWA_081	},
	{	44   ,	IDWA_082	}, // 충청남도
	{	43150,	IDWA_083	},
	{	43111,	IDWA_084	}, // 청주시
	{	43113,	IDWA_084	}, // 청주시
	{	43130,	IDWA_085	},
	{	43  ,	IDWA_086	}, // 충청북도
	{	11  ,	IDWA_087	}, // 서울특별시
	{	26  ,	IDWA_088	}, // 부산광역시
	{	28  ,	IDWA_089	}, // 인천광역시
	{	27  ,	IDWA_090	}, // 대구광역시
	{	31  ,	IDWA_091	}, // 울산광역시
	{	29  ,	IDWA_092	}, // 광주광역시
	{	30  ,	IDWA_093	}  // 대전광역시
} ;

#endif //__WAVTABLE_H__
